//通用正则
  	//不能输入特殊字符
	var noSpecialStr = /^[\u4E00-\u9FA5a-zA-Z0-9]{0,}$/;
	//只能输入汉字
	var onlyHanzi = /^[\u4e00-\u9fa5],{0,}$/;
	//用户密码，正确格式为：以字母开头，长度在6-18之间，只能包含字符、数字和下划线。 
	var userPwd = /^[a-zA-Z]\w{5,17}$/;
	
	// 电话号码
	var phoneNum = /^(\(\d{3,4}\)|\d{3,4}-)?\d{7,8}$/;
	//手机号码
	var mobileNum = /^[1][3,4,5,7,8][0-9]{9}$/;
	//验证InternetURL
 	var InternetURL=/^([hH][tT]{2}[pP]:\/\/|[hH][tT]{2}[pP][sS]:\/\/)(([A-Za-z0-9-~]+)\.)+([A-Za-z0-9-~\/])+$/;
	
   //验证身份证号（15位或18位数字）
   var idCard = /^\d{15}|\d{17}(\d|x)$/;
   
   //验证最多保留2位小数的百分数（如果没小数），可验证到十万位数，若是小数，则数字最大100，最多两位小数
   var percent = /^(100|[1-9]\d|\d)(.\d{1,2})?%$/;
   
   //验证数字
   var num0 = /^[0-9]*$/;
   
   //验证零和非零开头的数字
   var num1 = /^(0|[1-9][0-9]*)$/;
   
   //验证100以内的数字或者一位小数
   var num_100 = /^\d(\.\d)?$|^[1-9]\d(\.\d)?$/;
   //验证有两位小数的正实数
   var num2 = /^[0-9]+(.[0-9]{2})?$/;
   
   //验证非零的正整数
   var num3 = /^\+?[1-9][0-9]*$/;
   
   //验证n位的数字
   var num4 = /^\d{n}$/;
   
   //验证至少n位数字
   var num5 = /^\d{n,}$/;
   
   //验证m-n位的数字
   var num6 = /^\d{m,n}$/;
   
   //验证由26个英文字母组成的字符串
   var letter = /^[A-Za-z]+$/;
   
   //验证由26个大写英文字母组成的字符串
   var bigLetter = /^[A-Z]+$/;
   
   //验证由26个小写英文字母组成的字符串
   var smallLetter = /^[a-z]+$/;
   
   //验证组织架构代码9位（数字+大写字母）
   var OrganizationCode = /^[0-9A-Z]{n}$/;
  	
  	//手机mac（中间没有符号）
  	var mac1 = /^([0-9a-fA-F]{2})(([0-9a-fA-F]{2}){5})$/;
  	
  	//手机mac（中间有符号）
  	var mac2 = /^([0-9a-fA-F]{2})(([/\s:][0-9a-fA-F]{2}){5})$/;
  	
  	//手机misi码
  	var misi = /^(01|03)(\d{2})(\w{1})(\w{1})(\d{3})(\d{6})(\w{1})$/;
  	
	/*
	1. 必须包含数字、英文字母、特殊符号且大于等于8位
	2. 特殊符号包括: ~!@#$%^&*
	 * */
	var noChinese = /^(?=.*\d)(?=.*[a-zA-Z])(?=.*[~!@#$%^&*])[\da-zA-Z~!@#$%^&*]{8,}$/;
	
	//2到20的数字英文集合
	var numAndLetter = /^[0-9a-zA-Z]{2,20}$/;
	
	//非汉字，6到15位，特殊字符只能是：~!@#$%^&*的格式
	var moChinese2 = /^[0-9a-zA-Z~!@#$%^&*]{6,15}$/;
	
	//真实姓名只能是汉字或者英文字母
	var nolyChineseAndEnglish = /^[\u4e00-\u9fa5],{0,}|[A-Za-z]+$/;
	
	//账号(账号只能由字母、数字、点和下划线组成)
	var account = /^[a-zA-Z0-9_\.]+$/;
	
	var hanzi = /^[\u4e00-\u9fa5]{1,15}$/; //只可以输入1到15个中文字符
	
	//验证正数
	var zhengshu = /^([1-9][0-9]*(\.\d{1,2})?)|(0\.\d{1,2})$/;
	
	//ipv4地址
	var ipv4 = /(((\d{1,2})|(1\d{1,2})|(2[0-4]\d)|(25[0-5]))\.){3}((\d{1,2})|(1\d{1,2})|(2[0-4]\d)|(25[0-5]))/;
	
	//ipv6地址
	var ipv6 = /^([\\da-fA-F]{1,4}:){7}([\\da-fA-F]{1,4})$/;
	
	//端口
	var portReg = /^([0-9]|[1-9]\d|[1-9]\d{2}|[1-9]\d{3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/;